espressif/esp-brookesia/service/network/brookesia_service_http/test_apps/sdkconfig.ci.esp32s31_psram_xip
CONFIG_IDF_TARGET="esp32s31"

CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
